SuperSmashBro08/4WDKidsRideOn/firmware/ESP32_Uploader/esp32_uploader/esp32_ota_hub.h
#ifndef ESP32_UPLOADER_ESP32_OTA_HUB_H
#define ESP32_UPLOADER_ESP32_OTA_HUB_H
#define ESP32_OTA_HUB_H_INCLUDED
// ===== Mad Labs ESP32 OTA Hub (header-only) =====
// Web UI, Teensy .hex OTA over UART, ESP32 self-OTA .bin,
// live consoles, persisted last-result, reboot-friendly upload UX,
// plus diagnostics: UART1 stats, I2C scan, AS5600 dump.

#ifndef APP_NAME
  #define APP_NAME "ESP32_Uploader"
#endif
#ifndef APP_VER
  #define APP_VER  "v1.2.3"
#endif
#ifndef TEENSY_TX
  #define TEENSY_TX 43
#endif
#ifndef TEENSY_RX
  #define TEENSY_RX 44
#endif

// Teensy live console filter:
// 0 = store ALL non-empty lines; 1 = only lines starting with "S "
#ifndef TEENSY_CON_REQUIRE_S
  #define TEENSY_CON_REQUIRE_S 1
#endif

// I2C pins (default to SDA=8, SCL=9 for your board; override if needed)
#ifndef I2C_SDA_PIN
  #define I2C_SDA_PIN 8
#endif
#ifndef I2C_SCL_PIN
  #define I2C_SCL_PIN 9
#endif

#include <WiFi.h>
#include <WebServer.h>
#include <LittleFS.h>
#include <ESPmDNS.h>
#include <Update.h>
#include <Wire.h>      // NEW: for I2C diagnostics/AS5600
#include <stdarg.h>    // for ELOGF
#include <string.h>

// ---- Optional ESP-IDF rollback marking ----
#ifndef __has_include
  #define __has_include(x) 0
#endif
#if __has_include(<esp_idf_version.h>)
  #include <esp_idf_version.h>
#endif
#if __has_include(<esp_ota_ops.h>)
  #include <esp_ota_ops.h>
  #define HAVE_ESP_OTA_OPS 1
#endif

namespace OtaHub {

// ---------- Public API ----------
void begin(const char* wifiSsid, const char* wifiPass, const char* otaToken,
           const char* mdnsHost = "esp32-teensy");
void loop();

// ---------- Private (implementation) ----------
namespace {
  // Build timestamp
  static const char* APP_BUILD_DATE = __DATE__ " " __TIME__;

  // Secrets (provided by begin()) — renamed to avoid macro collisions
  static String HUB_WIFI_SSID, HUB_WIFI_PASS, HUB_OTA_TOKEN;

  // Peripherals
  static HardwareSerial SerialTeensy(1);
  static WebServer server(80);

  // Teensy OTA state
  static String lastOtaLog;
  static bool   lastOtaSuccess = false;
  static unsigned long lastOtaMillis = 0;

  // ESP32 self-OTA state
  static String esp32LastLog;
  static bool   esp32LastSuccess = false;
  static unsigned long esp32LastMillis = 0;

  // Teensy live console buffer
  static const uint16_t CON_CAP = 500;
  static String         conBuf[CON_CAP];
  static uint32_t       conId = 0;
  static String         conLine;

  // ESP32 live console (our own log ring)
  static const uint16_t E_CON_CAP = 800;
  static String         eConBuf[E_CON_CAP];
  static uint32_t       eConId = 0;

  // UART1 diagnostics (NEW)
  static volatile uint32_t uart1_rx_bytes = 0;
  static volatile uint32_t uart1_lines    = 0;
  static uint32_t          uart1_last_ms  = 0;

  // Teensy binary telemetry
  static constexpr uint8_t  TELEM_MAGIC0 = 0xA5;
  static constexpr uint8_t  TELEM_MAGIC1 = 0x5A;
  static constexpr uint8_t  TELEM_VERSION = 1;
  static constexpr size_t   TELEM_MAX_PAYLOAD = 64;

  struct __attribute__((packed)) TelemetryPayload {
    uint16_t seq;
    uint32_t millis;
    uint16_t flags;
    uint16_t s1;
    uint16_t t1;
    int16_t  s2_us;
    int16_t  t2_us;
    int16_t  s2_map;
    int16_t  t2_map;
    uint16_t as_raw;
    int16_t  as_deg_centi;
    uint8_t  gear;
    uint8_t  steer_target;
    uint8_t  steer_state;
    uint8_t  reserved;
    int16_t  steer_err_centi;
  };

  struct __attribute__((packed)) TelemetryPacket {
    uint8_t          magic0;
    uint8_t          magic1;
    uint8_t          version;
    uint8_t          length;
    TelemetryPayload payload;
  };

  static TelemetryPacket latestTelem{};
  static bool            telemetryValid    = false;
  static bool            telemetryHasSeq   = false;
  static uint16_t        telemetryLastSeq  = 0;
  static uint32_t        telemetryDropCount = 0;
  static uint32_t        telemetryUpdatedMs = 0;

  enum class TelemetryState : uint8_t { WaitMagic0, WaitMagic1, WaitVersion, WaitLength, ReadPayload, SkipPayload };

  struct TelemetryParser {
    TelemetryState state = TelemetryState::WaitMagic0;
    uint8_t        curVersion = 0;
    uint8_t        curLength  = 0;
    uint8_t        payload[TELEM_MAX_PAYLOAD] = {};
    uint8_t        pos = 0;
    uint8_t        skip = 0;
  };

  static TelemetryParser telemParser;

  static inline void telemetryResetParser(){ telemParser = TelemetryParser{}; }

  static bool telemetryConsumeByte(uint8_t b){
    TelemetryParser& p = telemParser;

    switch (p.state){
      case TelemetryState::WaitMagic0:
        if (b == TELEM_MAGIC0){
          p.state = TelemetryState::WaitMagic1;
          return true;
        }
        return false;

      case TelemetryState::WaitMagic1:
        if (b == TELEM_MAGIC1){
          p.state = TelemetryState::WaitVersion;
          return true;
        }
        p.state = TelemetryState::WaitMagic0;
        return false;

      case TelemetryState::WaitVersion:
        p.curVersion = b;
        p.state = TelemetryState::WaitLength;
        return true;

      case TelemetryState::WaitLength:
        p.curLength = b;
        if (p.curLength == 0){
          p.state = TelemetryState::WaitMagic0;
          return true;
        }
        if (p.curLength > TELEM_MAX_PAYLOAD){
          p.skip = p.curLength;
          p.state = TelemetryState::SkipPayload;
          return true;
        }
        p.pos = 0;
        p.state = TelemetryState::ReadPayload;
        return true;

      case TelemetryState::ReadPayload:
        p.payload[p.pos++] = b;
        if (p.pos >= p.curLength){
          if (p.curVersion == TELEM_VERSION && p.curLength == sizeof(TelemetryPayload)){
            memcpy(&latestTelem.payload, p.payload, sizeof(TelemetryPayload));
            latestTelem.magic0 = TELEM_MAGIC0;
            latestTelem.magic1 = TELEM_MAGIC1;
            latestTelem.version = p.curVersion;
            latestTelem.length  = p.curLength;
            telemetryValid      = true;
            telemetryUpdatedMs  = millis();
            uint16_t seq        = latestTelem.payload.seq;
            if (telemetryHasSeq){
              uint16_t delta = (uint16_t)(seq - telemetryLastSeq);
              if (delta > 1) telemetryDropCount += (uint32_t)(delta - 1);
            }
            telemetryLastSeq = seq;
            telemetryHasSeq  = true;
          }
          p.state = TelemetryState::WaitMagic0;
        }
        return true;

      case TelemetryState::SkipPayload:
        if (p.skip){
          --p.skip;
          if (!p.skip) p.state = TelemetryState::WaitMagic0;
        }
        return true;
    }

