SuperSmashBro08/4WDKidsRideOn/firmware/ESP32_Uploader/esp32_uploader/esp32_ota_hub.h
    p.state = TelemetryState::WaitMagic0;
    return false;
  }

  static void drainTeensyInput(){
    while (SerialTeensy.available()){
      int raw = SerialTeensy.read();
      if (raw < 0) break;
      telemetryConsumeByte((uint8_t)raw);
    }
  }

  // ----- Utilities -----
  static inline void conStore(const String& s){ ++conId; conBuf[conId % CON_CAP] = s; }
  static inline void eConStore(const String& s){ ++eConId; eConBuf[eConId % E_CON_CAP] = s; }
  static void ELOG(const String& s){ eConStore(s); Serial.println(s); }
  static void ELOGF(const char* fmt, ...) {
    char buf[256];
    va_list ap; va_start(ap, fmt); vsnprintf(buf, sizeof(buf), fmt, ap); va_end(ap);
    eConStore(String(buf)); Serial.println(buf);
  }

  static inline void markAppValidIfPossible() {
    #if defined(HAVE_ESP_OTA_OPS) && defined(CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE)
      #if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 4)
        esp_ota_mark_app_valid_cancel_rollback();
      #else
        #ifdef esp_ota_mark_app_valid
          esp_ota_mark_app_valid();
        #endif
      #endif
    #endif
  }

  static void ensureLittleFS(){
    if(!LittleFS.begin(true)) Serial.println("[FS] LittleFS mount failed");
    else                      Serial.println("[FS] LittleFS mounted");
  }

  static void connectWifi(const char* mdnsHost) {
    Serial.println("\n[WiFi] Connecting...");
    WiFi.mode(WIFI_STA);
    WiFi.setHostname(mdnsHost);
    WiFi.begin(HUB_WIFI_SSID.c_str(), HUB_WIFI_PASS.c_str());
    unsigned long t0=millis();
    while(WiFi.status()!=WL_CONNECTED){
      delay(250); Serial.print('.');
      if(millis()-t0>25000){ Serial.println("\n[WiFi] Failed. Rebooting."); delay(500); ESP.restart(); }
    }
    Serial.printf("\n[WiFi] Connected. IP: %s\n",WiFi.localIP().toString().c_str());
    if(MDNS.begin(mdnsHost)){ MDNS.addService("http","tcp",80); Serial.printf("[mDNS] %s.local ready\n", mdnsHost); }
    else Serial.println("[mDNS] start failed");
    ELOGF("Boot %s %s | IP %s", APP_NAME, APP_VER, WiFi.localIP().toString().c_str());
  }

  static String htmlEscape(const String& in) {
    String out; out.reserve(in.length() + 16);
    for (size_t i=0;i<in.length();++i) {
      char c = in[i];
      if (c=='&') out += F("&amp;");
      else if (c=='<') out += F("&lt;");
      else if (c=='>') out += F("&gt;");
      else out += c;
    }
    return out;
  }

  static bool readLineFrom(Stream& s, String& out, uint32_t to_ms=3000){
    out=""; unsigned long t0=millis();
    while(millis()-t0<to_ms){
      while(s.available()){
        int raw = s.read();
        if (raw < 0) break;
        uint8_t byte = (uint8_t)raw;
        if (telemetryConsumeByte(byte)) { t0 = millis(); continue; }
        if ((byte < 0x20 && byte != '\n' && byte != '\r') || byte >= 0x7F) { t0 = millis(); continue; }
        char c = (char)byte;
        if(c=='\r') continue;
        if(c=='\n'){ out.trim(); return true; }
        if(out.length()<400) out+=c;
      }
      delay(1); yield();
    }
    out.trim(); return out.length()>0;
  }

  enum class TelemetryState : uint8_t { WaitMagic0, WaitMagic1, WaitVersion, WaitLength, ReadPayload, SkipPayload };

  static bool telemetryConsumeByte(uint8_t b){
    static TelemetryState state = TelemetryState::WaitMagic0;
    static uint8_t curVersion = 0;
    static uint8_t curLength  = 0;
    static uint8_t payload[TELEM_MAX_PAYLOAD];
    static uint8_t pos = 0;
    static uint8_t skip = 0;

    switch (state){
      case TelemetryState::WaitMagic0:
        if (b == TELEM_MAGIC0){
          state = TelemetryState::WaitMagic1;
          return true;
        }
        return false;

      case TelemetryState::WaitMagic1:
        if (b == TELEM_MAGIC1){
          state = TelemetryState::WaitVersion;
          return true;
        }
        state = TelemetryState::WaitMagic0;
        return false;

      case TelemetryState::WaitVersion:
        curVersion = b;
        state = TelemetryState::WaitLength;
        return true;

      case TelemetryState::WaitLength:
        curLength = b;
        if (curLength == 0){
          state = TelemetryState::WaitMagic0;
          return true;
        }
        if (curLength > TELEM_MAX_PAYLOAD){
          skip = curLength;
          state = TelemetryState::SkipPayload;
          return true;
        }
        pos = 0;
        state = TelemetryState::ReadPayload;
        return true;

      case TelemetryState::ReadPayload:
        payload[pos++] = b;
        if (pos >= curLength){
          if (curVersion == TELEM_VERSION && curLength == sizeof(TelemetryPayload)){
            memcpy(&latestTelem.payload, payload, sizeof(TelemetryPayload));
            latestTelem.magic0 = TELEM_MAGIC0;
            latestTelem.magic1 = TELEM_MAGIC1;
            latestTelem.version = curVersion;
            latestTelem.length  = curLength;
            telemetryValid      = true;
            telemetryUpdatedMs  = millis();
            uint16_t seq        = latestTelem.payload.seq;
            if (telemetryHasSeq){
              uint16_t delta = (uint16_t)(seq - telemetryLastSeq);
              if (delta > 1) telemetryDropCount += (uint32_t)(delta - 1);
            }
            telemetryLastSeq = seq;
            telemetryHasSeq  = true;
          }
          state = TelemetryState::WaitMagic0;
        }
        return true;

      case TelemetryState::SkipPayload:
        if (skip){
          --skip;
          if (!skip) state = TelemetryState::WaitMagic0;
        }
        return true;
    }

    state = TelemetryState::WaitMagic0;
    return false;
  }

  // === Teensy console pump (robust CR/LF + idle flush) ===
  static void pumpTeensyConsole(){
    static bool lastWasCR = false;
    static uint32_t lastByteMs = 0;
    static uint32_t lastTextByteMs = 0;

    while (SerialTeensy.available()){
      int raw = SerialTeensy.read();
      if (raw < 0) break;
      uint8_t byte = (uint8_t)raw;
      uart1_rx_bytes++;
      uint32_t nowMs = millis();
      lastByteMs = uart1_last_ms = nowMs;

      if (telemetryConsumeByte(byte)){
        continue;
      }

      char c = (char)byte;
      if (c == '\r' || c == '\n'){
        if (c == '\n' && lastWasCR) { lastWasCR = false; continue; }
        lastWasCR = (c == '\r');
        lastTextByteMs = nowMs;

        conLine.trim();
        if (conLine.length()){
          bool stored=false;
          #if TEENSY_CON_REQUIRE_S
            if (conLine.startsWith("S ")){
              String trimmed = conLine;
              trimmed.remove(0,2);
              conStore(trimmed);
              stored=true;
            }
          #else
            String trimmed = conLine;
            if (trimmed.startsWith("S ")) trimmed.remove(0,2);
            conStore(trimmed);
            stored=true;
          #endif
          if (stored) uart1_lines++;
        }
        conLine = "";
      } else {
        lastWasCR = false;
        lastTextByteMs = nowMs;
        if (conLine.length() < 512) conLine += c;
      }
    }

