SuperSmashBro08/4WDKidsRideOn/firmware/ESP32_Uploader/esp32_uploader/esp32_ota_hub.h
    // idle flush (if newline never arrives)
    if (conLine.length() && (millis() - lastTextByteMs) > 120){
      conLine.trim();
      bool stored=false;
      #if TEENSY_CON_REQUIRE_S
        if (conLine.startsWith("S ")){
          String trimmed = conLine;
          trimmed.remove(0,2);
          conStore(trimmed);
          stored=true;
        }
      #else
        String trimmed = conLine;
        if (trimmed.startsWith("S ")) trimmed.remove(0,2);
        conStore(trimmed);
        stored=true;
      #endif
      conLine = "";
      if (stored) uart1_lines++;
    }
  }

  // ---------- Persist ESP32 last-OTA result across reboot ----------
  static void esp32WriteLastFile(bool ok, const String& log) {
    File f = LittleFS.open("/esp32_last.txt", FILE_WRITE);
    if (f) { f.print(ok ? "OK\n" : "ERR\n"); f.print(log); f.close(); }
  }
  static bool esp32ReadLastFile(String& out) {
    File f = LittleFS.open("/esp32_last.txt", FILE_READ);
    if (!f) return false;
    out = f.readString(); f.close(); return true;
  }

  // ---------- Teensy HEX helpers ----------
  static bool validateHexFile(File& f, String& err) {
    if (!f) { err="open failed"; return false; }
    if (!f.size()) { err="empty file"; return false; }
    size_t pos = f.position();
    String first = f.readStringUntil('\n'); first.trim();
    while (first.length()==0 && f.available()) { first = f.readStringUntil('\n'); first.trim(); }
    if (first.length()==0 || first[0] != ':') { err="not Intel HEX (no leading colon)"; f.seek(pos); return false; }
    f.seek(0);
    String line, lastNonEmpty;
    while (f.available()) { line = f.readStringUntil('\n'); line.trim(); if (line.length()) lastNonEmpty = line; }
    f.seek(0);
    if (lastNonEmpty != ":00000001FF") { err = "missing EOF (:00000001FF)"; return false; }
    return true;
  }

  static bool expectStartsWith(Stream& s, const char* prefix, String* captured=nullptr, uint32_t to_ms=3000) {
    String line; if (!readLineFrom(s, line, to_ms)) return false;
    Serial.print("<- "); Serial.println(line);
    if (captured) *captured = line;
    return line.startsWith(prefix);
  }

  static bool flashTeensyFromFS(const char* path, String& logOut) {
    File f = LittleFS.open(path, FILE_READ);
    String vErr;
    if (!validateHexFile(f, vErr)) { logOut += "HEX validate error: " + vErr + "\n"; f.close(); return false; }

    const size_t totalBytes = f.size();
    size_t sentBytes = 0;
    auto logProgress = [&](size_t extra) {
      sentBytes += extra;
      if (totalBytes) {
        int pct = (int)((100ULL * sentBytes) / totalBytes);
        logOut += "PROGRESS " + String(pct) + "% (" + String(sentBytes) + "/" + String(totalBytes) + ")\n";
      }
    };

    drainTeensyInput();

    SerialTeensy.printf("HELLO %s\r\n", HUB_OTA_TOKEN.c_str());
    logOut += "Sent HELLO\n";

    String resp;
    bool helloOk = false;
    uint8_t attempts = 0;
    unsigned long t_deadline = millis() + 4000;

    while (millis() < t_deadline && attempts < 3) {
      if (!readLineFrom(SerialTeensy, resp, 800)) {
        attempts++;
        SerialTeensy.printf("HELLO %s\r\n", HUB_OTA_TOKEN.c_str());
        logOut += "HELLO timeout, retrying...\n";
        continue;
      }
      logOut += "<- " + resp + "\n";
      if (resp == "READY") { helloOk = true; break; }
      if (resp == "BUSY")  { delay(250); continue; }
      if (resp == "NACK")  { logOut += "Token mismatch (NACK)\n"; break; }
      if (resp.startsWith("S ") || resp.startsWith("FW ") || resp.startsWith("FLASHERX ")) continue;
      if (resp == "ERR") { 
        attempts++; 
        SerialTeensy.printf("HELLO %s\r\n", HUB_OTA_TOKEN.c_str());
        logOut += "HELLO got ERR, retrying...\n"; 
        continue; 
      }
      logOut += "Unexpected during HELLO: " + resp + "\n";
    }
    if (!helloOk) { f.close(); return false; }

    SerialTeensy.print("BEGIN HEX\r\n");
    if (!expectStartsWith(SerialTeensy, "HEX BEGIN", &resp, 1500)) {
      logOut += "No HEX BEGIN (got: " + resp + ")\n"; f.close(); return false;
    }
    logOut += "<- " + resp + "\n";

    f.seek(0);
    size_t lineNumber = 0, ok=0, bad=0;
    const uint16_t lineDelayUs = 200;
    while (f.available()) {
      String rec = f.readStringUntil('\n'); rec.trim();
      if (!rec.length()) continue;
      lineNumber++;

      SerialTeensy.print("L "); SerialTeensy.print(rec); SerialTeensy.print("\r\n");

      String ack;
      if (!readLineFrom(SerialTeensy, ack, 1500)) { logOut += "Line " + String(lineNumber) + " timeout\n"; bad++; break; }
      logOut += "<- " + ack + "\n";

      if (ack.startsWith("OK ")) {
        uint32_t n = ack.substring(3).toInt();
        if (n != lineNumber) logOut += "WARN: OK index mismatch (got " + String(n) + ")\n";
        ok++;
      } else if (ack.startsWith("BAD ")) {
        bad++; logOut += "Teensy reported BAD at line " + String(lineNumber) + "\n"; break;
      } else {
        bad++; logOut += "Unexpected reply at line " + String(lineNumber) + ": " + ack + "\n"; 
        break;
      }

      logProgress(rec.length()+3);
      delayMicroseconds(lineDelayUs);
      yield();
    }
    f.close();

    SerialTeensy.print("END\r\n");
    logOut += "Sent lines: " + String(lineNumber) + " (OK=" + String(ok) + " BAD=" + String(bad) + ")\n";

    bool success = false;
    unsigned long t0 = millis();
    while (millis()-t0 < 6000) {
      String summary;
      if (!readLineFrom(SerialTeensy, summary, 500)) { yield(); continue; }
      logOut += summary + "\n";
      if (summary.startsWith("HEX OK")) success = true;
      if (summary=="APPLIED" || summary.startsWith("HEX ERR")) break;
    }
    return success && (bad==0);
  }

  // ---------- Diagnostics: UART1 + I2C + AS5600 ----------
  static void handleUart1Stats(){
    String out; out.reserve(256);
    out += "rx_bytes="; out += String(uart1_rx_bytes);
    out += "  lines=";  out += String(uart1_lines);
    out += "  last_ms="; out += String(uart1_last_ms);
    out += "\n";
    uint32_t cur = conId;
    if (cur){
      out += "tail: ";
      const String& line = conBuf[cur % CON_CAP];
      if (line.length()){
        if (line.length() > 120) out += line.substring(line.length()-120);
        else out += line;
      } else out += "<empty>";
      out += "\n";
    }
    out += "telemetry=";
    if (telemetryValid){
      out += "seq="; out += String(latestTelem.payload.seq);
      out += " drops="; out += String(telemetryDropCount);
      out += " age_ms="; out += String(millis() - telemetryUpdatedMs);
    } else {
      out += "none";
    }
    out += "\n";
    server.send(200, "text/plain", out);
  }

