SuperSmashBro08/4WDKidsRideOn/firmware/ESP32_Uploader/esp32_uploader/esp32_ota_hub.h
  static void handleTelemetryBin(){
    if (!telemetryValid || latestTelem.length == 0){
      server.send(204, "text/plain", "");
      return;
    }
    size_t payloadLen = 4u + latestTelem.length;
    server.setContentLength(payloadLen);
    server.send(200, "application/octet-stream", "");
    WiFiClient client = server.client();
    client.write(reinterpret_cast<const uint8_t*>(&latestTelem), payloadLen);
  }

  static void handleTelemetryJson(){
    String out;
    out.reserve(320);
    if (!telemetryValid){
      out = F("{\"valid\":false}");
    } else {
      const TelemetryPayload& p = latestTelem.payload;
      uint32_t age = millis() - telemetryUpdatedMs;
      out += F("{\"valid\":true");
      out += F(",\"seq\":"); out += p.seq;
      out += F(",\"millis\":"); out += p.millis;
      out += F(",\"flags\":"); out += p.flags;
      out += F(",\"s1\":"); out += p.s1;
      out += F(",\"t1\":"); out += p.t1;
      out += F(",\"s2_us\":"); out += (int)p.s2_us;
      out += F(",\"t2_us\":"); out += (int)p.t2_us;
      out += F(",\"s2_map\":"); out += (int)p.s2_map;
      out += F(",\"t2_map\":"); out += (int)p.t2_map;
      out += F(",\"as_raw\":"); out += p.as_raw;
      out += F(",\"as_deg_centi\":"); out += (int)p.as_deg_centi;
      out += F(",\"gear\":"); out += (unsigned)p.gear;
      out += F(",\"steer_target\":"); out += (unsigned)p.steer_target;
      out += F(",\"steer_state\":"); out += (unsigned)p.steer_state;
      out += F(",\"steer_err_centi\":"); out += (int)p.steer_err_centi;
      out += F(",\"drops\":"); out += telemetryDropCount;
      out += F(",\"age_ms\":"); out += age;
      out += '}';
    }
    server.send(200, "application/json", out);
  }

  static bool i2cReadN(uint8_t addr, uint8_t reg, uint8_t *buf, uint8_t n){
    Wire.beginTransmission(addr);
    Wire.write(reg);
    if (Wire.endTransmission(false) != 0) return false;
    int got = Wire.readBytes(buf, n);
    return got == n;
  }

  static void handleI2CScan(){
    Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN, 400000);
    String out; out.reserve(512);
    out += "Scanning I2C on SDA="; out += String(I2C_SDA_PIN);
    out += " SCL="; out += String(I2C_SCL_PIN); out += "\n";
    uint8_t found = 0;
    for (uint8_t a=0x03; a<=0x77; ++a){
      Wire.beginTransmission(a);
      uint8_t e = Wire.endTransmission();
      if (e == 0){
        out += "  - 0x"; out += String(a, HEX); out += "\n";
        found++;
      }
    }
    if (!found) out += "  (no devices)\n";
    server.send(200, "text/plain", out);
  }

  static void handleAS5600Dump(){
    const uint8_t ADDR = 0x36;
    Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN, 400000);

    String out; out.reserve(256);
    out += "AS5600 @ 0x36\n";

    uint8_t st=0;
    if (i2cReadN(ADDR, 0x0B, &st, 1)){
      out += "STATUS 0x0B = 0x"; out += String(st, HEX); out += "  (MD=";
      out += (st & 0x20) ? "1" : "0"; out += ", ML="; out += (st & 0x10) ? "1" : "0";
      out += ", MH="; out += (st & 0x08) ? "1" : "0"; out += ")\n";
    } else {
      out += "STATUS read failed\n";
    }

    uint8_t b[2];
    if (i2cReadN(ADDR, 0x0C, b, 2)){
      uint16_t raw = ((uint16_t)(b[0] & 0x0F) << 8) | b[1];
      float deg = raw * (360.0f/4096.0f);
      out += "ANGLE  raw="; out += String(raw);
      out += "  deg="; out += String(deg, 2); out += "\n";
    } else {
      out += "ANGLE read failed\n";
    }
    server.send(200, "text/plain", out);
  }

  // ---------- Pages (Teensy & ESP32 consoles + Index) ----------
  static String buildEsp32ConsolePage() {
    String page;
    page.reserve(2800);
    page += F(
      "<!doctype html><html><head><meta charset='utf-8'>"
      "<meta name=viewport content='width=device-width,initial-scale=1'>"
      "<title>ESP32 Console</title>"
      "<style>"
        "body{font-family:system-ui;margin:12px}"
        "#log{background:#0b1220;color:#d7e0f2;padding:12px;border-radius:8px;height:70vh;overflow:auto;font:13px ui-monospace,Consolas,monospace}"
      "</style>"
      "</head><body>"
      "<h3>ESP32 Console</h3><p><a href='/'>⬅ Back</a></p>"
      "<div id='log'></div>"
      "<script>"
        "let since=0;const log=document.getElementById('log');"
        "function addLine(t){if(!t)return;const d=document.createElement('div');d.textContent=t;log.appendChild(d);if(log.childNodes.length>1000)log.removeChild(log.firstChild);log.scrollTop=log.scrollHeight;}"
        "function pull(){fetch('/esp32-tail?since='+since).then(r=>r.text()).then(t=>{const n=t.indexOf('\\n');if(n>0){const hdr=t.substring(0,n);if(hdr.startsWith('NEXT '))since=parseInt(hdr.substring(5))||since;const body=t.substring(n+1);body.split('\\n').filter(Boolean).forEach(addLine);}}).catch(()=>{});}"
        "setInterval(pull,180);"
      "</script>"
      "</body></html>"
    );
    return page;
  }

  static String buildTeensyConsolePage() {
    String page;
    page.reserve(3200);
    page += F(
      "<!doctype html><html><head><meta charset='utf-8'>"
      "<meta name=viewport content='width=device-width,initial-scale=1'>"
      "<title>Teensy Console</title>"
      "<style>"
        "body{font-family:system-ui;margin:12px}"
        "#log{background:#0b1220;color:#d7e0f2;padding:12px;border-radius:8px;height:70vh;overflow:auto;font:13px ui-monospace,Consolas,monospace}"
        ".toolbar{margin:8px 0}"
        ".toolbar button{padding:6px 12px;border:0;border-radius:6px;background:#1f2937;color:#fff;cursor:pointer}"
        ".toolbar button:active{transform:translateY(1px)}"
      "</style>"
      "</head><body>"
      "<h3>Teensy Console</h3><p><a href='/'>⬅ Back</a></p>"
      "<div class='toolbar'><button id='clear-log' type='button'>Clear</button></div>"
      "<div id='log'></div>"
      "<script>"
        "let since=0;const log=document.getElementById('log');"
        "const clearBtn=document.getElementById('clear-log');"
        "if(clearBtn){clearBtn.addEventListener('click',()=>{log.innerHTML='';log.scrollTop=0;});}"
        "function addLine(t){if(!t)return;const d=document.createElement('div');d.textContent=t;log.appendChild(d);if(log.childNodes.length>1000)log.removeChild(log.firstChild);log.scrollTop=log.scrollHeight;}"
        "function pull(){fetch('/tail?since='+since).then(r=>r.text()).then(t=>{const n=t.indexOf('\\n');if(n>0){const hdr=t.substring(0,n);if(hdr.startsWith('NEXT '))since=parseInt(hdr.substring(5))||since;const body=t.substring(n+1);body.split('\\n').filter(Boolean).forEach(addLine);}}).catch(()=>{});}"
        "setInterval(pull,180);"
      "</script>"
      "</body></html>"
    );
    return page;
  }

  static String buildIndexPage() {
    String page;
    page.reserve(12000);
    page += F(
      "<!doctype html><html><head><meta charset='utf-8'>"
      "<meta name=viewport content='width=device-width,initial-scale=1'>"
      "<title>Mad Labs OTA Hub</title>"
      "<style>"
        "body{font-family:system-ui;margin:24px;max-width:900px}"
        "section{margin:18px 0;padding:16px;border:1px solid #e5e7eb;border-radius:12px}"
        "h2,h3{margin:0 0 8px 0}"
        "pre{background:#f6f8fa;padding:12px;border-radius:8px;overflow:auto}"
        "code{background:#f6f8fa;padding:2px 6px;border-radius:4px}"
        ".row{display:flex;gap:12px;align-items:center;flex-wrap:wrap}"
        "button{padding:8px 14px;border:0;border-radius:8px;background:#111;color:#fff;cursor:pointer}"
        "button[disabled]{opacity:.6;cursor:not-allowed}"
        "a.btn{display:inline-block;padding:8px 12px;border-radius:8px;background:#0b5;color:#fff;text-decoration:none}"
        ".bar{width:100%;height:12px;background:#eee;border-radius:6px;overflow:hidden;margin:8px 0 4px 0;display:none}"
        ".fill{height:100%;width:0%}"
        ".ok{background:#2ecc71}.bad{background:#e74c3c}.info{background:#3498db}"
        ".muted{color:#64748b}"
      "</style></head><body>"
      "<h2>Mad Labs OTA Hub</h2>"
      "<p class='muted'>Upload new firmware for <b>Teensy (.hex)</b> and <b>ESP32 (.bin)</b>, and view live consoles.</p>"
    );

