SuperSmashBro08/4WDKidsRideOn/firmware/ESP32_Uploader/esp32_uploader/esp32_ota_hub.h
    // Teensy section...
    page += F(
      "<section><h3>Update Teensy (.hex)</h3>"
      "<form id='f-teensy' method='POST' action='/upload' enctype='multipart/form-data'>"
      "<div class='row'>"
      "<input id='file-teensy' type='file' name='firmware' accept='.hex' required>"
      "<button id='go-teensy' type='submit'>Upload & Flash</button>"
      "<a class='btn' href='/console'>Teensy Live Console</a>"
      "<button type='button' onclick=\"fetch('/ping').then(r=>r.text()).then(t=>alert(t)).catch(()=>alert('ping failed'))\">Ping Teensy</button>"
      "<button type='button' onclick=\"fetch('/version').then(r=>r.text()).then(t=>alert(t)).catch(()=>alert('version failed'))\">Get Teensy Version</button>"
      "</div>"
      "<div id='bar-teensy' class='bar'><div id='fill-teensy' class='fill info'></div></div>"
      "<div id='status-teensy'></div></form></section>"
    );

    // ESP32 section...
    page += F(
      "<section><h3>Update ESP32 (.bin)</h3>"
      "<div class='row'>"
      "<input id='file-esp' type='file' accept='.bin' required>"
      "<button id='go-esp' type='button' onclick=\"(function(){"
        "try{"
          "var fE=document.getElementById('file-esp');"
          "var barE=document.getElementById('bar-esp');"
          "var fillE=document.getElementById('fill-esp');"
          "var statE=document.getElementById('status-esp');"
          "var btnE=document.getElementById('go-esp');"
          "if(!fE||!fE.files||!fE.files.length){alert('Choose a .bin first');return;}"
          "btnE.disabled=true;"
          "statE.textContent='Uploading…';"
          "barE.style.display='block';"
          "fillE.style.width='0%';"
          "fillE.className='fill info';"

          "var fd=new FormData();"
          "fd.append('firmware', fE.files[0]);"
          "var xhr=new XMLHttpRequest();"
          "xhr.open('POST','/esp32-ota');"
          "xhr.timeout=240000;"

          "var sawProgress=false;"
          "xhr.upload.onprogress=function(ev){"
            "if(ev.lengthComputable){sawProgress=true;fillE.style.width=Math.round((ev.loaded/ev.total)*100)+'%';}"
            "else{fillE.style.width='100%';}"
          "};"
          "xhr.onreadystatechange=function(){if(xhr.readyState===2){fillE.style.width='100%';}};"

          "function pollBackOnline(){"
            "var tries=0;"
            "(function tick(){"
              "fetch('/esp32-version?x='+(Date.now()),{cache:'no-store'})"
              ".then(function(r){return r.text();})"
              ".then(function(txt){"
                "fillE.className='fill ok';"
                "var first=(txt||'').split('\\n')[0];"
                "statE.textContent='ESP32 back online ✔'+(first?(' — '+first):'');"
                "btnE.disabled=false;"
              "})"
              ".catch(function(){"
                "if(++tries<=60){ setTimeout(tick,1000); }"
                "else { statE.textContent='ESP32 flashed, but not responding yet.'; btnE.disabled=false; }"
              "});"
            "})();"
          "}"

          "function finish(){"
            "var body=(xhr.responseText||'').trim();"
            "var ok=(xhr.status===200 && body==='OK');"
            "if(ok){"
              "fillE.className='fill ok';"
              "statE.textContent='ESP32 flashed. Rebooting…';"
              "pollBackOnline();"
            "}else{"
              "if(xhr.status===0 && sawProgress){"
                "statE.textContent='Rebooting… (connection will drop briefly)';"
                "fillE.className='fill info';"
                "pollBackOnline();"
              "}else{"
                "fillE.className='fill bad';"
                "statE.textContent='ESP32 update failed. HTTP '+xhr.status+' '+xhr.statusText+' | Body: '+body;"
                "btnE.disabled=false;"
              "}"
            "}"
          "}"

          "xhr.onload=finish;"
          "xhr.onerror=finish;"
          "xhr.ontimeout=finish;"
          "xhr.send(fd);"
        "}catch(e){alert('ESP32 JS error: '+e);}"
      "})()\">Upload & Flash</button>"
      "<a class='btn' href='/esp32-console'>ESP32 Live Console</a>"
      "<button type='button' onclick=\"fetch('/esp32-ping').then(r=>r.text()).then(t=>alert(t)).catch(()=>alert('ping failed'))\">Ping ESP32</button>"
      "<button type='button' onclick=\"fetch('/esp32-version').then(r=>r.text()).then(t=>alert(t)).catch(()=>alert('version failed'))\">Get ESP32 Version</button>"
      "</div>"
      "<div id='bar-esp' class='bar'><div id='fill-esp' class='fill info'></div></div>"
      "<div id='status-esp'></div>"
      "</section>"
    );

    // Last results (Teensy + ESP32)
    if (lastOtaLog.length()) {
      page += lastOtaSuccess ? F("<h3 style='color:#0a0'>Last Teensy OTA: success</h3>") : F("<h3 style='color:#b00'>Last Teensy OTA: failed</h3>");
      if (lastOtaMillis) {
        page += F("<p class='muted'><small>Completed ");
        page += String((millis() - lastOtaMillis) / 1000);
        page += F(" s ago</small></p>");
      }
      page += F("<pre>"); page += htmlEscape(lastOtaLog); page += F("</pre>");
    }
    if (esp32LastLog.length()) {
      page += esp32LastSuccess ? F("<h3 style='color:#0a0'>Last ESP32 OTA: success</h3>") : F("<h3 style='color:#b00'>Last ESP32 OTA: failed</h3>");
      if (esp32LastMillis) {
        page += F("<p class='muted'><small>Completed ");
        page += String((millis() - esp32LastMillis) / 1000);
        page += F(" s ago</small></p>");
      }
      page += F("<pre>"); page += htmlEscape(esp32LastLog); page += F("</pre>");
    }

    // Teensy JS uploader
    page += F(
      "<script>"
      "const ft=document.getElementById('f-teensy');"
      "const bt=document.getElementById('go-teensy');"
      "const fT=document.getElementById('file-teensy');"
      "const barT=document.getElementById('bar-teensy');"
      "const fillT=document.getElementById('fill-teensy');"
      "const statT=document.getElementById('status-teensy');"
      "function finalizeTeensyUI(ok){fillT.className=ok?'fill ok':'fill bad';statT.textContent=ok?'Flashing complete.':'Upload failed.';setTimeout(function(){window.location='/'},900);}"
      "async function checkTeensyLast(){try{const r=await fetch('/last',{cache:'no-store'});const t=await r.text();finalizeTeensyUI(t.trim()==='OK');}catch(e){finalizeTeensyLast(false);}}"
      "ft.addEventListener('submit',function(e){"
        "e.preventDefault();"
        "if(!fT.files.length){alert('Choose a .hex first');return;}"
        "bt.disabled=true;"
        "statT.textContent='Uploading…';"
        "barT.style.display='block';"
        "fillT.style.width='0%';"
        "fillT.className='fill info';"
        "const xhr=new XMLHttpRequest();"
        "xhr.open('POST','/upload');"
        "xhr.timeout=180000;"
        "xhr.upload.onprogress=function(ev){"
          "if(ev.lengthComputable){fillT.style.width=Math.round((ev.loaded/ev.total)*100)+'%';}"
          "else{fillT.style.width='100%';}"
        "};"
        "xhr.onload=function(){checkTeensyLast();};"
        "xhr.onerror=function(){checkTeensyLast();};"
        "xhr.ontimeout=function(){checkTeensyLast();};"
        "xhr.send(new FormData(ft));"
      "});"
      "</script>"
      "</body></html>"
    );
    return page;
  }

  // ---------- HTTP Handlers ----------
  static void handleRoot(){ server.send(200,"text/html",buildIndexPage()); }

