SuperSmashBro08/4WDKidsRideOn/firmware/ESP32_Uploader/esp32_uploader/esp32_ota_hub.h
  // Teensy quick commands
  static void handlePing(){
    drainTeensyInput();
    SerialTeensy.print("PING\r\n");
    String r; if (readLineFrom(SerialTeensy, r, 800)) server.send(200,"text/plain",r);
    else server.send(504,"text/plain","timeout");
  }
  static void handleVersion(){
    drainTeensyInput();
    SerialTeensy.print("VERSION\r\n");
    String a,b,o;
    if (readLineFrom(SerialTeensy,a,800)) o+=a+"\n";
    if (readLineFrom(SerialTeensy,b,200)) o+=b+"\n";
    server.send(o.length()?200:504,"text/plain",o.length()?o:"timeout");
  }
  static void handleLast(){ server.send(200,"text/plain",lastOtaSuccess?"OK":"ERR"); }

  // ESP32 quick commands
  static void handleEspPing(){ server.send(200,"text/plain","ESP32 PONG "+String(millis())); }
  static void handleEspVersion(){
    String out; out.reserve(128);
    out += APP_NAME; out += " "; out += APP_VER; out += "\n";
    out += "Build: "; out += APP_BUILD_DATE; out += "\n";
    out += "IP: "; out += WiFi.localIP().toString(); out += "\n";
    server.send(200,"text/plain",out);
  }
  static void handleEsp32Last(){
    String buf;
    if (esp32ReadLastFile(buf)) {
      int nl = buf.indexOf('\n');
      String head = (nl >= 0) ? buf.substring(0, nl) : buf;
      server.send(200, "text/plain", head);
      return;
    }
    server.send(200,"text/plain",esp32LastSuccess?"OK":"ERR");
  }

  // Console pages
  static void handleConsolePage(){ server.send(200,"text/html",buildTeensyConsolePage()); }
  static void handleEsp32ConsolePage(){ server.send(200,"text/html",buildEsp32ConsolePage()); }

  // Tail endpoints
  static void handleTail(){ // Teensy
    uint32_t since=0;
    if(server.hasArg("since")) since=(uint32_t)strtoul(server.arg("since").c_str(),nullptr,10);
    const uint16_t MAX_LINES=200;
    uint32_t curId=conId;
    if(since>=curId){ server.send(200,"text/plain","NEXT "+String(curId)+"\n"); return; }
    uint32_t start=since+1;
    if(start+MAX_LINES<curId) start=curId-MAX_LINES;
    String out; out.reserve(4096);
    out += "NEXT "; out += String(curId); out += "\n";
    for(uint32_t id=start; id<=curId; ++id){
      if((curId-id)>=CON_CAP) continue;
      const String& line = conBuf[id % CON_CAP];
      if(line.length()){ out += line; out += "\n"; if(out.length()>60000) break; }
    }
    server.send(200,"text/plain",out);
  }
  static void handleEsp32Tail(){ // ESP32
    uint32_t since=0;
    if(server.hasArg("since")) since=(uint32_t)strtoul(server.arg("since").c_str(),nullptr,10);
    const uint16_t MAX_LINES=300;
    uint32_t curId=eConId;
    if(since>=curId){ server.send(200,"text/plain","NEXT "+String(curId)+"\n"); return; }
    uint32_t start=since+1;
    if(start+MAX_LINES<curId) start=curId-MAX_LINES;
    String out; out.reserve(4096);
    out += "NEXT "; out += String(curId); out += "\n";
    for(uint32_t id=start; id<=curId; ++id){
      if((curId-id)>=E_CON_CAP) continue;
      const String& line = eConBuf[id % E_CON_CAP];
      if(line.length()){ out += line; out += "\n"; if(out.length()>60000) break; }
    }
    server.send(200,"text/plain",out);
  }

  // ---------- Teensy upload (.hex) ----------
  static File uploadFile;
  static bool uploadedWasHex = false;
  static String uploadName;

  static void handleUpload() {
    HTTPUpload& up = server.upload();

    if (up.status == UPLOAD_FILE_START) {
      uploadName = up.filename;
      uploadedWasHex = uploadName.endsWith(".hex") || uploadName.endsWith(".HEX");
      Serial.printf("[HTTP] Upload start: %s\n", uploadName.c_str());
      uploadFile = LittleFS.open("/teensy41.hex", FILE_WRITE);
      if (!uploadFile) { Serial.println("[HTTP] open for write failed"); }
    }
    else if (up.status == UPLOAD_FILE_WRITE) {
      if (uploadFile) uploadFile.write(up.buf, up.currentSize);
    }
    else if (up.status == UPLOAD_FILE_END) {
      if (!uploadFile) { server.send(500, "text/plain", "Upload failed to open file"); return; }
      uploadFile.close();
      Serial.printf("[HTTP] Upload complete: %s bytes=%u\n", uploadName.c_str(), up.totalSize);

      if (!uploadedWasHex) {
        LittleFS.remove("/teensy41.hex");
        server.send(415, "text/plain", "Please upload the Teensy Intel HEX (.hex) file.");
        return;
      }

      String log;
      bool ok = flashTeensyFromFS("/teensy41.hex", log);

      lastOtaSuccess = ok;
      lastOtaLog = log;
      lastOtaMillis = millis();

      Serial.println("[TEENSY OTA RESULT]\n" + log);
      server.send(ok ? 200 : 500, "text/plain", ok ? "OK\n" : "ERR\n");
    }
  }

  // ---------- ESP32 self-OTA (.bin) ----------
  static void handleEsp32Ota() {
    HTTPUpload& up = server.upload();

    if (up.status == UPLOAD_FILE_START) {
      String fname = up.filename;
      bool isBin = fname.endsWith(".bin") || fname.endsWith(".BIN");
      esp32LastLog = "";
      esp32LastSuccess = false;
      Serial.printf("[ESP32 OTA] Upload start: %s\n", fname.c_str());
      ELOGF("ESP32 OTA start: %s", fname.c_str());

      if (!isBin) {
        esp32LastLog += "Reject: not a .bin\n";
        return; // handled in END stage
      }

      if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
        esp32LastLog += "Update.begin failed: ";
        esp32LastLog += String(Update.errorString()) + "\n";
      } else {
        esp32LastLog += "Update.begin OK\n";
      }
    }
    else if (up.status == UPLOAD_FILE_WRITE) {
      if (!Update.hasError()) {
        size_t n = Update.write(up.buf, up.currentSize);
        if (n != up.currentSize) {
          esp32LastLog += "Write short: ";
          esp32LastLog += String(n) + " of " + String(up.currentSize) + "\n";
        }
      }
    }
    else if (up.status == UPLOAD_FILE_END) {
      bool ok = false;
      if (!Update.hasError()) {
        ok = Update.end(true); // set as valid app
        if (!ok) {
          esp32LastLog += "Update.end failed: ";
          esp32LastLog += String(Update.errorString()) + "\n";
        } else {
          esp32LastLog += "Update.end OK\n";
          markAppValidIfPossible();
        }
      } else {
        esp32LastLog += "Update error before end: ";
        esp32LastLog += String(Update.errorString()) + "\n";
      }

      esp32LastSuccess = ok;
      esp32LastMillis = millis();
      Serial.println("[ESP32 OTA RESULT]\n" + esp32LastLog);
      ELOG(ok ? "ESP32 OTA: SUCCESS" : "ESP32 OTA: FAIL");

      // Persist the outcome so UI can read it even after reboot
      esp32WriteLastFile(ok, esp32LastLog);

      if (ok) {
        server.sendHeader("Connection", "close");
        server.send(200, "text/plain", "OK\n");
        delay(800);            // let TCP flush
        ESP.restart();         // reboot into new app
      } else {
        server.send(500, "text/plain", "ERR\n");
      }
    }
    else if (up.status == UPLOAD_FILE_ABORTED) {
      Update.abort();
      esp32LastLog += "Upload aborted\n";
      esp32LastSuccess = false;
      esp32WriteLastFile(false, esp32LastLog);
      server.send(500, "text/plain", "ERR\n");
    }
  }

