SuperSmashBro08/4WDKidsRideOn/firmware/ESP32_Uploader/esp32_uploader/esp32_ota_hub.h
  // ---------- Route setup ----------
  static void setupRoutes() {
    server.on("/",              HTTP_GET,  handleRoot);

    // Teensy
    server.on("/upload",        HTTP_POST, [](){}, handleUpload);
    server.on("/ping",          HTTP_GET,  handlePing);
    server.on("/version",       HTTP_GET,  handleVersion);
    server.on("/last",          HTTP_GET,  handleLast);
    server.on("/console",       HTTP_GET,  handleConsolePage);
    server.on("/tail",          HTTP_GET,  handleTail);
    server.on("/telemetry.bin", HTTP_GET,  handleTelemetryBin);
    server.on("/telemetry.json",HTTP_GET,  handleTelemetryJson);

    // ESP32
    server.on("/esp32-ota",     HTTP_POST, [](){}, handleEsp32Ota);
    server.on("/esp32-last",    HTTP_GET,  handleEsp32Last);
    server.on("/esp32-ping",    HTTP_GET,  handleEspPing);
    server.on("/esp32-version", HTTP_GET,  handleEspVersion);
    server.on("/esp32-console", HTTP_GET,  handleEsp32ConsolePage);
    server.on("/esp32-tail",    HTTP_GET,  handleEsp32Tail);

    // Diagnostics (NEW)
    server.on("/uart1-stats",   HTTP_GET,  handleUart1Stats);
    server.on("/i2c-scan",      HTTP_GET,  handleI2CScan);
    server.on("/as5600-dump",   HTTP_GET,  handleAS5600Dump);
  }

} // namespace (private)

// ---------- Public API impl ----------
void begin(const char* wifiSsid, const char* wifiPass, const char* otaToken,
           const char* mdnsHost) {
  HUB_WIFI_SSID = wifiSsid;
  HUB_WIFI_PASS = wifiPass;
  HUB_OTA_TOKEN = otaToken;

  Serial.begin(115200);
  delay(200);
  Serial.println("\n== ESP32 ⇄ Teensy OTA Hub + Console ==");
  ELOGF("Starting %s %s | Build %s", APP_NAME, APP_VER, APP_BUILD_DATE);

  ensureLittleFS();
  connectWifi(mdnsHost);

  // Start I2C early so diagnostics are ready
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN, 400000);

  SerialTeensy.setRxBufferSize(4096);
  SerialTeensy.setTxBufferSize(1024);
  SerialTeensy.begin(230400, SERIAL_8N1, TEENSY_RX, TEENSY_TX);
  telemetryResetParser();
  Serial.printf("[UART] SerialTeensy on RX=%d TX=%d @230400\n", TEENSY_RX, TEENSY_TX);
  ELOGF("UART to Teensy: RX=%d TX=%d @230400", TEENSY_RX, TEENSY_TX);

  setupRoutes();
  server.begin();
  Serial.println("[HTTP] Server ready.");
  ELOG("HTTP server ready.");
}

void loop() {
  pumpTeensyConsole();
  server.handleClient();

  static unsigned long lastCheck = 0;
  if (millis()-lastCheck > 3000) {
    lastCheck = millis();
    if (WiFi.status() != WL_CONNECTED) {
      Serial.println("[WiFi] Lost, rebooting");
      ELOG("WiFi lost — rebooting");
      delay(250); ESP.restart();
    }
  }
}

} // namespace OtaHub

#endif // ESP32_UPLOADER_ESP32_OTA_HUB_H
